In [2]:
import numpy as np
import pandas as pd

In [3]:
size = 5
data = np.hstack([
    2**np.arange(size).reshape(size,1),
    3**np.arange(size).reshape(size,1)
])
df = pd.DataFrame(data=data)
df

    0   1
0   1   1
1   2   3
2   4   9
3   8  27
4  16  81

In [4]:
df.rolling(window=3, center=False).std()

          0          1
0       NaN        NaN
1       NaN        NaN
2  1.527525   4.163332
3  3.055050  12.489996
4  6.110101  37.469988

In [5]:
df.expanding(min_periods=1).sum()

      0      1
0   1.0    1.0
1   3.0    4.0
2   7.0   13.0
3  15.0   40.0
4  31.0  121.0

In [6]:
a = df.ewm(com=2)
a.mean()

          0          1
0  1.000000   1.000000
1  1.600000   2.200000
2  2.736842   5.421053
3  4.923077  14.384615
4  9.175355  39.957346

# Aggregation

In [8]:
r = df.rolling(window=3,min_periods=1)

In [9]:
r.aggregate(np.sum)

      0      1
0   1.0    1.0
1   3.0    4.0
2   7.0   13.0
3  14.0   39.0
4  28.0  117.0

In [10]:
def aggregation_function(array):
    print(array)
    return np.sum(np.square(array))
r.aggregate(aggregation_function)

0    1.0
dtype: float64
0    1.0
1    2.0
dtype: float64
0    1.0
1    2.0
2    4.0
dtype: float64
1    2.0
2    4.0
3    8.0
dtype: float64
2     4.0
3     8.0
4    16.0
dtype: float64
0    1.0
dtype: float64
0    1.0
1    3.0
dtype: float64
0    1.0
1    3.0
2    9.0
dtype: float64
1     3.0
2     9.0
3    27.0
dtype: float64
2     9.0
3    27.0
4    81.0
dtype: float64

       0       1
0    1.0     1.0
1    5.0    10.0
2   21.0    91.0
3   84.0   819.0
4  336.0  7371.0

In [14]:
def aggregation_function(array):
    return np.sum(np.square(array))
r[0].aggregate(aggregation_function)

0      1.0
1      5.0
2     21.0
3     84.0
4    336.0
Name: 0, dtype: float64

In [18]:
def aggregation_function(array):
    return np.sum(np.square(array))
a = r.aggregate([np.sum, np.mean])
print(type(a))
print(a.columns)
a

<class 'pandas.core.frame.DataFrame'>
MultiIndex(levels=[[0, 1], ['sum', 'mean']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

      0                1
    sum      mean    sum       mean
0   1.0  1.000000    1.0   1.000000
1   3.0  1.500000    4.0   2.000000
2   7.0  2.333333   13.0   4.333333
3  14.0  4.666667   39.0  13.000000
4  28.0  9.333333  117.0  39.000000